{
  "ticker": "AAPL",
  "name": "Apple Inc",
  "lei": "HWUPKR0MPOU8FGXBT394",
  "legal_name": "Apple Inc",
  "stock_exchange": "NasdaqGS",
  "sic": 3571,
  "short_description": "Apple Inc. designs, manufactures, and markets mobile communication and media devices, personal computers, and portable digital music players to consumers, small and mid-sized businesses, education, and enterprise and government customers worldwide.",
  "long_description": "Apple Inc. designs, manufactures, and markets mobile communication and media devices, personal computers, and portable digital music players to consumers, small and mid-sized businesses, education, and enterprise and government customers worldwide. The company also sells related software, services, accessories, networking solutions, and third-party digital content and applications. It offers iPhone, a line of smartphones; iPad, a line of multi-purpose tablets; and Mac, a line of desktop and portable personal computers. The company also provides iLife, a consumer-oriented digital lifestyle software application suite; iWork, an integrated productivity suite that helps users create, present, and publish documents, presentations, and spreadsheets; and other application software, such as Final Cut Pro, Logic Pro X, and FileMaker Pro. In addition, it offers Apple TV that connects to consumers' TV and enables them to access digital content directly for streaming high definition video, playing music and games, and viewing photos; Apple Watch, a personal electronic device; and iPod, a line of portable digital music and media players. Further, the company sells Apple-branded and third-party Mac-compatible, and iOS-compatible accessories, such as headphones, displays, storage devices, Beats products, and other connectivity and computing products and supplies. Additionally, it offers iCloud, a cloud service; AppleCare that offers support options for its customers; and Apple Pay, a mobile payment service. The company sells and delivers digital content and applications through the iTunes Store, App Store, iBooks Store, Mac App Store, and Apple Music. It also sells its products through its retail and online stores, and direct sales force, as well as through third-party cellular network carriers, wholesalers, retailers, and value-added resellers. Apple Inc. was founded in 1977 and is headquartered in Cupertino, California.",
  "ceo": "Tim Cook",
  "company_url": "http://www.apple.com",
  "business_address": "ONE INFINITE LOOP, CUPERTINO, CA 95014",
  "mailing_address": "ONE INFINITE LOOP, CUPERTINO, CA 95014",
  "business_phone_no": "(408) 996-1010",
  "hq_address1": "1 Infinite Loop",
  "hq_address2": null,
  "hq_address_city": "Cupertino",
  "hq_address_postal_code": "95014",
  "entity_legal_form": "INCORPORATED",
  "securities": [
    {
      "ticker": "AAPL",
      "security_name": "Apple Inc. - Common Stock",
      "security_type": "Common Stock",
      "security_class": null,
      "stock_exchange": "NasdaqGS",
      "listing_exchange": "Nasdaq",
      "market_category": "Global Select Market",
      "etf": false,
      "round_lot_size": 100,
      "financial_status": "N",
      "primary_security": true,
      "delisted_security": false,
      "last_crsp_adj_date": "2016-08-04"
    }
  ],
  "cik": "0000320193",
  "hq_state": "California",
  "hq_country": "United States of America",
  "inc_state": "California",
  "inc_country": "United States of America",
  "employees": 110000,
  "entity_status": "ACTIVE",
  "sector": "Consumer Goods",
  "industry_category": "Consumer Durables",
  "industry_group": "Electronic Equipment",
  "template": "industrial",
  "standardized_active": true
}